УРВ_файловая/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </resources>
  <resources>
    <name>ПотребоватьСменуПароляПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияНеОграничен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПросрочкаРаботыВПрограммеДоЗапрещенияВхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешенияВходаВПрограмму</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаАвтоматическогоЗапрещенияВхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаИспользованияПароля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованныеПароли</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПоследнийИспользуемыйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/CommonForms/ФормаКомментария/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Дата, Автор, ЛинияПоддержки, Комментарий, ВнутренняяПереписка, ВыбраннаяСтрока");
	
	Если Пользователи.АвторизованныйПользователь() = Автор Или Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Комментарий.ТолькоПросмотр = Ложь;
		Элементы.ВнутренняяПереписка.ТолькоПросмотр = Ложь;
		Элементы.ГруппаКнопки.Видимость = Истина;
	КонецЕсли;
	
	СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
	Если СведенияОПользователе.ОбслуживающаяОрганизация = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Или 
		Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ВнутренняяПереписка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
    
#КонецОбласти

#Область ОбработчикиКомандФормы
    
&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", Дата);
	Результат.Вставить("Автор", Автор);
	Результат.Вставить("ЛинияПоддержки", ЛинияПоддержки);
	Результат.Вставить("Комментарий", Комментарий);
	Результат.Вставить("ВнутренняяПереписка", ВнутренняяПереписка);
	Результат.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
